Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: Use the `quarkus.micrometer.binder.http-server.match-patterns` property if the correct URL can not be determined. This property accepts a comma-separated list defining an association between a simple regex match pattern and a replacement string. For example, setting `quarkus.micrometer.binder.http-server.match-patterns=/example/prime/[0-9]+=/example/{jellybeans}` would use the value `/example/{jellybeans}` for the uri attribute any time the requested uri matches `/example/prime/[0-9]+`.
zh_cn: 如果不能确定正确的URL，请使用 `quarkus.micrometer.binder.http-server.match-patterns` 属性。这个属性使用一个逗号分隔的列表来定义一个简单的正则匹配模式和对应的替换字符串之间的关联。例如，设置成 `quarkus.micrometer.binder.http-server.match-patterns=/example/prime/[0-9]+=/example/{jellybeans}` ，则可以请求的URI与 `/example/prime/[0-9]+` 匹配时为URI属性使用 `/example/{jellybeans}` 的值。

source: Use the `quay.io/quarkus/ubi-quarkus-native-image:{graalvm-flavor}` docker image introduced in <<#multistage-docker,Using a multi-stage Docker build>> to build the native image.
zh_cn: 使用 <<#multistage-docker,Using a multi-stage Docker build>> 中介绍的 `quay.io/quarkus/ubi-quarkus-native-image:{graalvm-flavor}` docker镜像来构建原生镜像。

source: Use the `received` method on `beverages` channel to check the messages produced by the application.
zh_cn: 在 `beverages` channel 上使用 `received` 方法来检查应用程序产生的消息。

source: Use the `send` method to send a message to the `orders` channel. The application will process this message and send a message to `beverages` channel.
zh_cn: 使用 `send` 方法向 `orders` channel 发送一个消息。应用程序将处理这个消息并向 `beverages` channel 发送消息。

source: Use the command below, to delete an increment given its key.
zh_cn: 使用下面的命令，删除一个键的增量：

source: Use the following command to recursively delete the `com.apple.quarantine` extended attribute on the GraalVM install directory as a workaround:
zh_cn: 其中一种解决方法是，使用以下命令递归删除GraalVM安装目录上的 `com.apple.quarantine` 扩展属性：

source: Use the following information to help you to decide which authentication mechanism to use to secure your Quarkus applications:
zh_cn: 使用以下信息来帮助您决定使用哪种认证机制来保护您的Quarkus应用程序：

source: Use this JRE definition as your Quarkus project targeted runtime and the workaround will be applied to any "Run as JUnit" configuration.
zh_cn: 使用这个JRE定义作为您的Quarkus项目的目标运行时，该运行时将被用于所有 "作为JUnit运行(Run as JUnit) "的配置。

source: User Info
zh_cn: 用户信息

source: User info support
zh_cn: 支持UserInfo

source: Users can even provide their own `ObjectMapper` bean if they so choose. If this is done, it is very important to manually inject and apply all `io.quarkus.jackson.ObjectMapperCustomizer` beans in the CDI producer that produces `ObjectMapper`. Failure to do so will prevent Jackson specific customizations provided by various extensions from being applied.
zh_cn: 如果用户选择的话，他们甚至可以提供自己的 `ObjectMapper` bean。如果这样做，在产生 `ObjectMapper` 的CDI生产者中，手动注入和应用所有 `io.quarkus.jackson.ObjectMapperCustomizer` Bean是非常重要的。如果不这样做，就会阻止各种扩展所提供的Jackson特定的自定义功能被应用。

source: Uses GraalVM 21.+
zh_cn: 使用GraalVM 21.+

source: Using @ApplicationScoped Beans as Verticle
zh_cn: 使用@ApplicationScoped Beans作为Verticle

source: Using AI to optimize a schedule with OptaPlanner
zh_cn: 使用人工智能来优化OptaPlanner的日程安排

source: Using AMQP with Reactive Messaging
zh_cn: 使用AMQP与响应式消息传递

source: Using Apache Kafka Streams
zh_cn: 使用Apache Kafka Streams

source: Using Apache Kafka with Schema Registry and Avro
zh_cn: 使用Apache Kafka与模式仓库和Avro

source: Using Blaze-Persistence
zh_cn: 使用Blaze-Persistence

source: Using Eclipse Vert.x API from a Quarkus Application
zh_cn: 在Quarkus应用程序中使用Eclipse Vert.x API

source: Using Fault Tolerance
zh_cn: 使用容错技术

source: Using Flyway
zh_cn: 使用Flyway

source: Using HTTP with Reactive Messaging
zh_cn: 将 HTTP 与响应式消息结合使用

source: Using HTTPS or SSL/TLS
zh_cn: 使用HTTPS或SSL/TLS

source: Using HashiCorp Vault with Databases
zh_cn: 在数据库中使用HashiCorp Vault

source: Using HashiCorp Vault’s PKI Secret Engine
zh_cn: 使用HashiCorp Vault的PKI加密引擎

source: Using Health Check
zh_cn: 使用健康检查

source: Using Hibernate ORM and JPA
zh_cn: 使用Hibernate ORM和JPA

source: Using Hibernate Reactive
zh_cn: 使用Hibernate响应式

source: Using Hibernate Reactive with Panache to interact with a database in a reactive fashion
zh_cn: 将 Hibernate Reactive 与 Panache 结合使用，以响应式方式与数据库进行交互

source: Using Infinispan Client
zh_cn: 使用Infinispan客户端

source: Using JMS
zh_cn: 使用JMS

source: Using JWT RBAC
zh_cn: 使用 JWT RBAC

source: Using Keycloak to centralize authorization
zh_cn: 使用Keycloak进行集中授权

source: Using Kogito DMN support to add decision automation capabilities to an application
zh_cn: 使用Kogito DMN支持为应用程序添加决策自动化功能

source: Using Kogito to add business automation capabilities to an application
zh_cn: 使用Kogito为应用程序添加业务自动化功能

source: Using Kogito to add prediction capabilities to an application
zh_cn: 使用Kogito为应用程序添加预测功能

source: Using Kogito to add rule engine capabilities to an application
zh_cn: 使用Kogito为应用程序添加规则引擎功能

source: Using Kotlin
zh_cn: 使用Kotlin

source: Using LRA (Long Running Actions)
zh_cn: 使用LRA（长期运行的活动）。

source: Using MeterFilter to configure metrics
zh_cn: 使用MeterFilter来配置metrics

source: Using OAuth2 RBAC
zh_cn: 使用OAuth2 RBAC

source: Using OpenAPI and Swagger UI
zh_cn: 使用OpenAPI和Swagger UI

source: Using OpenID Connect (OIDC) Multi-Tenancy
zh_cn: 使用OpenID Connect（OIDC）多租户

source: Using OpenID Connect (OIDC) and Keycloak to Centralize Authorization
zh_cn: 使用OpenID连接（OIDC）与Keycloak来做集中式授权

source: Using OpenID Connect (OIDC) and Keycloak to Centralize Authorizations
zh_cn: 使用OpenID Connect（OIDC）和Keycloak来集中授权

source: Using OpenID Connect (OIDC) and OAuth2 Client and Filters
zh_cn: 使用OpenID Connect（OIDC）和OAuth2客户端和过滤器

source: Using OpenID Connect (OIDC) to Protect Service Applications
zh_cn: 使用OpenID Connect（OIDC）来保护服务应用

source: Using OpenID Connect (OIDC) to Protect Service Applications using Bearer Token Authorization
zh_cn: 用OpenID Connect（OIDC）来保护使用不记名令牌授权的服务应用

source: Using OpenID Connect (OIDC) to Protect Web Applications
zh_cn: 使用OpenID Connect（OIDC）来保护网络应用程序

source: Using OpenTelemetry
zh_cn: 使用OpenTelemetry

source: Using OpenTracing
zh_cn: 使用OpenTracing

source: Using Property Expressions
zh_cn: 使用属性表达式

source: Using RESTEasy Reactive to implement HTTP API while enforcing the reactive principle
zh_cn: 使用 RESTEasy Reactive 实现 HTTP API，同时强制执行响应式原则

source: Using RabbitMQ
zh_cn: 使用RabbitMQ

source: Using RabbitMQ with Reactive Messaging
zh_cn: 使用RabbitMQ与响应式消息传递

source: Using Reactive Routes
zh_cn: 使用响应式路由

source: Using Response
zh_cn: 使用Response

source: Using SSL With Native Executables
zh_cn: 在原生可执行文件中使用SSL

source: Using Schema Registry
zh_cn: 使用Schema注册表

source: Using Security with .properties File
zh_cn: 使用.properties文件的安全性

source: Using Security with JDBC
zh_cn: 使用JDBC的安全性

source: Using Security with JPA
zh_cn: 使用JPA的安全性

source: Using Security with LDAP
zh_cn: 使用LDAP的安全性

source: Using Security with WebAuthn
zh_cn: 使用WebAuthn的安全性

source: Using Sentry to Monitor your Logs
zh_cn: 使用Sentry来监控你的日志

source: Using Snappy for message compression
zh_cn: 使用Snappy进行消息压缩

source: Using Software Transactional Memory
zh_cn: 使用软件事务性内存

source: Using Spies instead of Mocks with `@InjectSpy`
zh_cn: 通过 `@InjectSpy` 用Spies来代替Mocks

source: Using Spring Boot's ConfigurationProperties
zh_cn: 使用Spring Boot的ConfigurationProperties

source: Using Transactions
zh_cn: 使用事务

source: Using Transactions in Quarkus
zh_cn: 在Quarkus中使用事务

source: Using Vault
zh_cn: 使用Vault

source: Using Vault Transit Secret Engine
zh_cn: 使用Vault Transit保密引擎

source: Using Vert.x
zh_cn: 使用Vert.x

source: Using Vert.x Clients
zh_cn: 使用Vert.x客户端

source: Using Vert.x Core API
zh_cn: 使用Vert.x核心API

source: Using Vert.x JSON
zh_cn: 使用Vert.x JSON

source: Using Vert.x clients
zh_cn: 使用 Vert.x 客户端

source: Using Vert.x stream capability
zh_cn: 使用Vert.x流的功能

source: Using WebSockets
zh_cn: 使用WebSockets

source: Using WebSockets with Reactive Messaging
zh_cn: 使用WebSockets与响应式消息传递

source: Using `@BsonProperty` is not needed to define custom column mappings, as the mappings from the entity class will be used.
zh_cn: 使用 `@BsonProperty` ，不需要定义自定义列映射，因为将使用来自实体类的映射。

source: Using `@DisabledOnIntegrationTest` will also disable the test in all integration test instances, including testing the application in JVM mode, in a container image, and native image.
zh_cn: 使用 `@DisabledOnIntegrationTest` 还将禁用所有集成测试实例中的测试，包括在JVM模式、容器镜像和原生镜像中测试应用程序。

source: Using `@InjectMock` with `@RestClient`
zh_cn: 使用 `@InjectMock` 与 `@RestClient`

source: Using `@InjectMock`, the previous example could be written as follows:
zh_cn: 使用 `@InjectMock` ，前面的例子可以写成下面形式：

source: Using `@Inject` will get you a CDI proxy to the mock instance you install, which is not suitable for passing to methods such as `Mockito.verify` which want the mock instance itself. So if you need to call methods such as `verify` you need to hang on to the mock instance in your test, or use `@InjectMock` as shown below.
zh_cn: 使用 `@Inject` ，您会得到一个对您安装的mock实例的CDI代理，它并不适合传递给诸如 `Mockito.verify` 这样的方法，这些方法会需要mock实例本身。因此，如果您需要调用诸如 `verify` 这样的方法，您需要在您的测试中挂载mock实例，或者使用 `@InjectMock` ，如下所示。

source: Using `@QuarkusIntegrationTest`
zh_cn: 使用@QuarkusIntegrationTest

source: Using a Distroless base image
zh_cn: 使用无发行版基础镜像

source: Using a configuration file
zh_cn: 使用配置文件

source: Using a multi-stage Docker build
zh_cn: 使用多阶段的Docker构建

source: Using a range instead of pages
zh_cn: 使用range而不是pages

source: Using a scratch base image
zh_cn: 使用Scratch基础镜像

source: Using annotations is limited, as you can't dynamically assign meaningful tag values. Also note that many methods, e.g. REST endpoint methods or Vert.x Routes, are counted and timed by the micrometer extension out of the box.
zh_cn: 使用注解是被限制的，因为您不能动态地分配有意义的标签值。还要注意的是，许多方法的计数和计时，例如REST节点方法或Vert.x Routes，Micrometer扩展都支持开箱即用。

source: Using codecs
zh_cn: 使用编解码器

source: Using injection
zh_cn: 使用注入法

source: Using mongo+srv:// urls
zh_cn: 使用mongo+srv:// urls

source: Using multiple verticles instances
zh_cn: 使用多个verticles的实例

source: Using other Registry implementations
zh_cn: 使用其他Registry实现

source: Using our Tooling
zh_cn: 使用我们的工具

source: Using such a construct means that a `--initialize-at-run-time` option will automatically be added to the `native-image` command line.
zh_cn: 使用这样的结构意味着 `--initialize-at-run-time` 参数将被自动添加到 `native-image` 命令行中。

source: Using such a construct means that a `-H:DynamicProxyConfigurationResources` option will automatically be added to the `native-image` command line.
zh_cn: 使用这样的结构意味着 `-H:DynamicProxyConfigurationResources` 参数将被自动添加到 `native-image` 命令行中。

source: Using the @RegisterForReflection annotation
zh_cn: 使用@RegisterForReflection注解

source: Using the AWS Java SDK v2
zh_cn: 使用AWS Java SDK v2

source: Using the Flyway object
zh_cn: 使用Flyway对象

source: Using the JsonWebToken and Claim Injection
zh_cn: 使用JsonWebToken和声明(claim)注入

source: Using the Kubernetes Client to Interact with a Kubernetes Cluster
zh_cn: 使用Kubernetes客户端与Kubernetes集群互动

source: Using the MongoDB Client
zh_cn: 使用MongoDB客户端

source: Using the Quarkus CLI
zh_cn: 使用Quarkus CLI

source: Using the Quarkus Extension for Spring Cache
zh_cn: 使用Quarkus Extension for Spring Cache

source: Using the Quarkus Extension for Spring Cloud Config
zh_cn: 使用Quarkus Extension for Spring Cloud Config

source: Using the Quarkus Extension for Spring DI API
zh_cn: 使用Quarkus Extension for Spring DI API

source: Using the Quarkus Extension for Spring Data JPA API
zh_cn: 使用Quarkus Extension for Spring Data JPA API

source: Using the Quarkus Extension for Spring Scheduled
zh_cn: 使用Quarkus Extension for Spring Scheduled

source: Using the Quarkus Extension for Spring Security API
zh_cn: 使用Quarkus Extension for Spring Security API

source: Using the Quarkus Extension for Spring Web API
zh_cn: 使用Quarkus Extension for Spring Web API

source: Using the Quarkus Kubernetes extension, developers can perform or automate a single-step deployment using Jib, Docker, and Source-to-Image (S2i) including the creation of DeploymentConfig to trigger automatic redeployments. <a href="{{site.baseurl}}/guides/deploying-to-kubernetes">Read the guide for more details.</a>
zh_cn: 使用Quarkus Kubernetes扩展，开发人员可以使用Jib、Docker和Source-to-Image（S2i）执行或自动进行单步部署，包括创建DeploymentConfig以触发自动重新部署。 <a href="{{site.baseurl}}/guides/deploying-to-kubernetes">阅读指南了解更多细节</a>

source: Using the Quarkus OIDC extension, both Bearer Token and Authorization Code Flow mechanisms use <<smallrye-jwt, SmallRye JWT>> to represent JWT tokens as MicroProfile JWT `org.eclipse.microprofile.jwt.JsonWebToken`.
zh_cn: 通过 `Quarkus OIDC` 扩展， `Bearer` 和 `Authorization Code Flow` 认证机制都使用 link:#smallrye-jwt[SmallRye JWT] 来将Microprofile JWT `org.eclipse.microprofile.jwt.JsonWebToken` 表示为JWTtoken。

source: Using the REST Client (including JSON)
zh_cn: 使用REST客户端（包括JSON）

source: Using the REST Client with Multipart
zh_cn: 使用Multipart的REST客户端

source: Using the RESTEasy Classic REST Client (including JSON)
zh_cn: 使用RESTEasy Classic REST客户端（包括JSON）。

source: Using the Redis Client
zh_cn: 使用Redis客户端

source: Using the `Emitter` you are sending messages from your imperative code to reactive messaging. These messages are stored in a queue until they are sent. If the Kafka producer client can't keep up with messages trying to be sent over to Kafka, this queue can become a memory hog and you may even run out of memory. You can use `@OnOverflow` to configure back-pressure strategy. It lets you configure the size of the queue (default is 256) and the strategy to apply when the buffer size is reached. Available strategies are `DROP`, `LATEST`, `FAIL`, `BUFFER`, `UNBOUNDED_BUFFER` and `NONE`.
zh_cn: 使用 `Emitter` 的话您会以命令式代码的方式发送消息到响应式消息中(reactive messaging)。这些消息被存储在一个队列中，直到它们被发送。如果Kafka生产者client无法跟上发送到Kafka的消息节奏，这个队列就会成为一个内存占用者，甚至会耗尽内存。您可以使用 `@OnOverflow` 来配置背压策略。它可以让您配置队列的大小(默认是256)和达到缓冲区上限时要应用的策略。可用的策略有 `DROP` , `LATEST` , `FAIL` , `BUFFER` , `UNBOUNDED_BUFFER` 和 `NONE` 。

source: Using the `health-topic-verification-enabled=true` attribute, _startup_ probe uses an _admin client_ to check for the list of topics. Whereas the _readiness_ probe for an incoming channel checks that at least one partition is assigned for consumption, and for an outgoing channel checks that the topic used by the producer exist in the broker.
zh_cn: 使用 `health-topic-verification-enabled=true` 属性， _启动_ 探针使用一个 _管理客户端_ 来检查topic列表。而传入 channel 的 _就绪_ 探针将检查是否至少有一个分区被分配用于消费，而传出 channel 则检查生产者使用的topic是否存在于broker中。

source: Using the active record pattern
zh_cn: 使用Active Record模式

source: Using the active-record pattern
zh_cn: 使用active-record模式

source: Using the base image
zh_cn: 使用此基础镜像

source: Using the container-image extensions
zh_cn: 使用容器-镜像扩展

source: Using the event bus
zh_cn: 使用事件总线

source: Using the repository pattern
zh_cn: 使用资源库模式

source: Using unique consumer groups
zh_cn: 使用单一的消费者组

source: Using verticles
zh_cn: 使用verticles

source: Using xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] is recommended for the integration testing against Keycloak. `Dev Services for Keycloak` will launch and initialize a test container: it will create a `quarkus` realm, a `quarkus-app` client (`secret` secret) and add `alice` (`admin` and `user` roles) and `bob` (`user` role) users, where all of these properties can be customized.
zh_cn: 建议使用 link:security-openid-connect-dev-services.html[Keycloak开发服务] 进行针对Keycloak的集成测试。 `Keycloak开发服务` 将启动和初始化一个测试容器：它将创建一个 `quarkus` 领域，一个 `quarkus-app` 客户端（ `secret` 秘密）并添加 `alice` （ `admin` 和 `user` 角色）和 `bob` （ `user` 角色）用户，其中所有这些属性都可以被定制。

source: VSCode "run with" configuration
zh_cn: VSCode "run with "配置

source: Validation with Hibernate Validator
zh_cn: 用Hibernate验证器进行验证

source: Variables
zh_cn: 变量

source: Variables for Use in Documents
zh_cn: 文件中使用的变量

source: Verify Maven is using the Java you expect
zh_cn: 验证Maven是否使用了你期望的Java版本

source: Verify that Maven is using the Java version you expect. If you have multiple JDKs installed, make sure Maven is using the expected one. You can verify which JDK Maven uses by running `mvn --version.`
zh_cn: 验证Maven正在使用您期望的Java版本。如果安装了多个JDK，请确保Maven使用的是适当的版本。你可以通过运行 `mvn --version` 来验证Maven使用的是哪个JDK

source: Version {graalvm-version} is required. Using the community edition is enough.
zh_cn: 版本 {graalvm-version} 是必需的。使用社区版就可以了。

source: Vert.x APIs often rely on JSON. Vert.x provides two convenient classes to manipulate JSON document: `io.vertx.core.json.JsonObject` and `io.vertx.core.json.JsonArray`.
zh_cn: Vert.x的API经常依赖JSON。Vert.x提供了两个方便的类来操作JSON文档： `io.vertx.core.json.JsonObject` 和 `io.vertx.core.json.JsonArray` 。

source: Vert.x Reference Guide
zh_cn: Vert.x参考指南

source: Vert.x comes with a built-in https://vertx.io/docs/vertx-core/java/#event_bus[event bus] that you can use from your Quarkus application. So, your application components (CDI beans, resources...) can interact using asynchronous events, thus promoting loose-coupling.
zh_cn: Vert.x有一个内置的 link:https://vertx.io/docs/vertx-core/java/#event_bus[事件总线] ，你可以从你的Quarkus应用程序中使用。因此，你的应用程序组件（CDI Bean、resources......）可以使用异步事件进行交互，从而促进松散耦合。

source: Vert.x is capable of using https://netty.io/wiki/native-transports.html[Netty's native transports], which offers performance improvements on specific platforms.To enable them, you must include the appropriate dependency for your platform. It's usually a good idea to have both to keep your application platform agnostic. Netty is smart enough to use the correct one, that includes none at all on unsupported platforms:
zh_cn: Vert.x能够使用 https://netty.io/wiki/native-transports.html[Netty的本地传输] ，在特定的平台上提供性能改进。要启用它们，你必须为你的平台包含适当的依赖。通常，为了保持你的应用程序与平台无关，这是个好主意。Netty很聪明，会使用正确的依赖，包括在不支持的平台上根本不使用：

source: Very similarly, Quarkus allows extensions authors to register a `NativeImageProxyDefinitionBuildItem`. An example of doing so is:
zh_cn: 非常相似的是，Quarkus允许扩展作者注册一个 `NativeImageProxyDefinitionBuildItem` 。这样做的一个例子是：

source: Video podcast hosted by Quarkus Developers about things moving in and around Quarkus ecosystem.
zh_cn: 由Quarkus开发者主办的关于在Quarkus生态系统内和周边事物的视频播客。

source: View the https://docs.aws.amazon.com/lambda/latest/dg/gettingstarted-awscli.html[Getting Started Guide] for deploying a lambda with AWS CLI. Specifically, make sure you have created an `Execution Role`. You will need to define a `LAMBDA_ROLE_ARN` environment variable in your profile or console window, Alternatively, you can edit the `manage.sh` script that is generated by the build and put the role value directly there:
zh_cn: 查看使用AWS CLI部署lambda的 link:https://docs.aws.amazon.com/lambda/latest/dg/gettingstarted-awscli.html[入门指南] 。具体来说，确保你已经创建了一个 `Execution Role` 。你需要在你的配置文件或控制台窗口中定义一个 `LAMBDA_ROLE_ARN` 环境变量，或者，你可以编辑由构建生成的 `manage.sh` 脚本，并把角色值直接放在那里：

source: Visual Studio Code extension to install using the marketplace
zh_cn: 使用Visual Studio Code插件市场安装

source: Visualize and configure extensions as well as access to application logs and testing components
zh_cn: 可视化和配置扩展，以及访问应用程序日志和测试组件

source: Want to have your extension added to the Quarkiverse?
zh_cn: 想让您的扩展功能加入到Quarkiverse中吗？

source: We also handle some basic date type transformations: all fields of type `Date`, `LocalDate`, `LocalDateTime` or `Instant` will be mapped to the link:https://docs.mongodb.com/manual/reference/bson-types/#date[BSON Date] using the `ISODate` type (UTC datetime). The MongoDB POJO codec doesn't support `ZonedDateTime` and `OffsetDateTime` so you should convert them prior usage.
zh_cn: 我们还处理一些基本的日期类型转换：所有类型为 `Date` , `LocalDate` , `LocalDateTime` 或 `Instant` 的字段都将使用 `ISODate` 类型（UTC日期时间）映射到 link:https://docs.mongodb.com/manual/reference/bson-types/#date[BSON Date] 。MongoDB的POJO编解码器不支持 `ZonedDateTime` 和 `OffsetDateTime` ，因此你应该在使用前转换它们

source: We also need to update the tests. Edit the `CountResourceTest` class to match:
zh_cn: 此外，我们还需要更新测试。如下编辑 `CountResourceTest` 类:

source: We also set the `java.util.logging.manager` system property to make sure tests will use the correct logmanager and `maven.home` to ensure that custom configuration from `${maven.home}/conf/settings.xml` is applied (if any).
zh_cn: 我们还设置了 `java.util.logging.manager` 系统属性，以确保测试使用正确的日志管理器。同时设置 `maven.home` 属性，以确保 `${maven.home}/conf/settings.xml` 的自定义配置被设置（如果有的话）。

source: We also set the `java.util.logging` system property to make sure tests will use the correct log manager and `maven.home` to ensure that custom configuration from `${maven.home}/conf/settings.xml` is applied (if any).
zh_cn: 我们还设置了 `java.util.logging` 系统属性，以确保测试将使用正确的日志管理器和 `maven.home` ，以确保应用 `${maven.home}/conf/settings.xml` 的自定义配置（如果有的话）。

source: We also update the `ReactiveGreetingResource.kt` like so:
zh_cn: 我们还要这样更新 `ReactiveGreetingResource.kt` ：

source: We are going to build a simple application exposing four HTTP endpoints:
zh_cn: 我们将构建一个简单应用程序 它包含四个暴露出的端点:

source: We are going to create an `IncrementService` class which will play the role of a Redis client. With this class, we'll be able to perform the `SET`, `GET` , `DELET`, `KEYS` and `INCRBY` Redis commands.
zh_cn: 我们将创建一个 `IncrementService` 类，它将扮演Redis客户端的角色。这个类能够执行 `SET` , `GET` , `DELET` , `KEYS` 和 `INCRBY` 等Redis命令。

source: We are going to model our increments using the `Increment` POJO. Create the `src/main/java/org/acme/redis/Increment.java` file, with the following content:
zh_cn: 我们将使用 `Increment` POJO来模拟递增操作。创建 `src/main/java/org/acme/redis/Increment.java` 文件，内容如下：

source: We are including the public key as a resource in the native executable.
zh_cn: 我们将公钥作为一种资源纳入本地可执行文件。

source: We are setting public key location to point to a classpath publicKey.pem location. We will add this key in part B, <<Adding a Public Key>>.
zh_cn: 我们设置公钥位置以指向classpath publicKey.pem所在位置。我们将在B部分中 <<添加公钥>> 。

source: We are setting the issuer to the URL string `https://example.com/issuer`.
zh_cn: 我们将发行者issuer设置为URL字符串 `https://example.com/issuer` .

source: We are using `curl -w "\n"` in this example to avoid your terminal printing a '%' or put both result and next command prompt on the same line.
zh_cn: 我们在这个例子中使用 `curl -w "\n"` ，以避免你的终端打印出'%'或把结果和下一个命令提示符放在同一行。

source: We are verifying that we get the mocked response from the Spy.
zh_cn: 这里我们正在验证从Spy那里得到了mock响应。

source: We can register `Legume` for reflection manually by adding the `@RegisterForReflection` annotation on our `Legume` class:
zh_cn: 我们可以通过在我们的 `Legume` 类上添加 `@RegisterForReflection` 注解来手动注册 `Legume` 进行反射：

source: We create the first increment, with the key `first` and an initial value of `10`.
zh_cn: 我们创建第一个增量，键为 `first` ，初始值为 `10` 。

source: We don't include the legacy MongoDB client by default. It contains the now retired MongoDB Java API (DB, DBCollection,... ) and the `com.mongodb.MongoClient` that is now superseded by `com.mongodb.client.MongoClient`.
zh_cn: 我们默认不包括旧版的MongoDB客户端。它包含现已废弃的MongoDB Java API（DB、DBCollection......）以及现已被 `com.mongodb.client.MongoClient` 所取代的 `com.mongodb.MongoClient` 。

source: We don’t want you to spend hours learning new technologies. Instead, the Quarkus programming model builds on top of proven standards. Be it official standards such as Eclipse MicroProfile or leading frameworks in a specific domain such as Eclipse Vert.x.
zh_cn: 我们不希望你花时间学习新技术。相反，Quarkus编程模型构建在经过验证的标准之上。无论是官方标准(如Eclipse MicroProfile)还是特定领域的领先框架(如Eclipse Vert.x)。

source: We extend our previous tests as a convenience, but you can also implement your tests.
zh_cn: 为了方便起见，我们扩展了之前的测试，但您也可以实现您自己的测试。

source: We extend our previous tests, but you can also implement your tests
zh_cn: 我们扩展了之前的测试，但您也可以实现自己的测试

source: We get the expected JSON array. RESTEasy Reactive automatically maps the list into a JSON Array, except if instructed otherwise.
zh_cn: 我们得到了预期的JSON数组。RESTEasy Reactive自动将列表映射到JSON数组，除非另有指示。
